semestr2/logika/22.02.2021-język.md

# Table of Contents

1.  [znaki](#orgec0a21a)
2.  [znak jako symptom, oznaka](#org1ea0f12)
3.  [ślad](#org2784b32)
4.  [funkcja znaku](#orgf4cc264)
        1.  [słownik](#org4823bde)
        2.  [reguły znaczeniowe języka](#org592562f)
        3.  [reguły skladni języka](#orgebf5d45)
5.  [Rodzaje języków](#orgfa3846e)
    1.  [ze względu na fizyczny charakter znaków](#orge68d2d9)
    2.  [języki sztuczne](#orgeed492a)



<a id="orgec0a21a"></a>

# znaki

konwencje referencji - prawdziwość wypowiedzi

konwencje semantyczne - sens wypowiedzi

przezroczystość znaku - odbiorca znaku widzi poprzez znak zawartość komunikatu  


<a id="org1ea0f12"></a>

# znak jako symptom, oznaka


<a id="org2784b32"></a>

# ślad


<a id="orgf4cc264"></a>

# funkcja znaku

**\* funkcja znaczenia - znaczenie danego wyrażenia w danycm języku to sposób w jaki należy to wyrażenie w tym języku zrozumieć
\*** funkcja wyrażania - znaki językowe opisuja wrażenia psychiczne, 


<a id="org4823bde"></a>

### słownik

-   słownikiem danego języka nazywa się zbiór symboli elementarych i wyrażeń (alfabet i słownik(w węższym tego słowa znaczeniu))


<a id="org592562f"></a>

### reguły znaczeniowe języka

-   reguły których należy przestrzegać by nie naruszyć znaczenia wyrażeń


<a id="orgebf5d45"></a>

### reguły skladni języka

-   reguły które określają jakie połączenia znaków prostych (np słów) są również znakami tego języka


<a id="orgfa3846e"></a>

# Rodzaje języków


<a id="orge68d2d9"></a>

## ze względu na fizyczny charakter znaków

-   aukustyczne
-   graficzne
-   gestowo-mimiczny (nie funkcjonuje on samodzielnie, najczęsciej z językiem mówionym)


<a id="orgeed492a"></a>

## języki sztuczne

-   warunek ekonomiczności języka - eiminacja elementów zbędnych

